import 'dart:io';
//Напиши програму, яка:
//
// 1. Запитує у користувача:
//
//    * Скільки грошей у нього є на рахунку (гроші);
//    * Скільки коштує 1 година стоянки (цінаГодини);
//    * Скільки годин користувач хоче простояти (бажаніГодини).
//
// 2. Починає "паркування" на кожну годину.
//
// 3. Після кожної години виводить скільки грошей залишилося.
//
// 4. Якщо грошей не вистачає на наступну годину, програма виводить повідомлення, що гроші закінчилися, і паркування припиняється.

void main(List<String> arguments) {
  print('Доброго дня скільки грошей у вас на рахунку?');
  double cardMoney= double.parse(stdin.readLineSync()!);
  print('Скільки коштує 1 година стоянки ?');
  double  parkingHours =double.parse(stdin.readLineSync()!);
  print('Скільки годин ви бажаєте простояти?');
  int parkingTime = int.parse(stdin.readLineSync()!);
  int hour = 1;
  for(int i = 0 ; i<=parkingTime;i++){
    print('Парковка розпочалась $i');
    if(i==hour) {
      print('Ви простояли вже $hour');
      hour++;
      cardMoney-=parkingHours;
      print('У вас на рахунку залишилось  $cardMoney');
      
    }
  }
}