import 'dart:io';

//Умова задачі:
//
// Уяви, що ти їдеш на автомобілі до міста, яке знаходиться на певній відстані — скажімо, відстань кілометрів. У тебе є повний бак пального, в якому обʼємБака літрів пального. Автомобіль витрачає витратаНа100км літрів на 100 км.
//
// Твоя задача — написати програму, яка:
//  1. Запитує у користувача:
//  • скільки кілометрів до міста (відстань);
//  • який обʼєм пального в баку (обʼємБака);
//  • яка витрата пального на 100 км (витратаНа100км).
//  2. Починає “рухатись” до міста, кроками по 10 км.
//  3. Після кожних 10 км виводить скільки пального залишилося.
//  4. Якщо пального не вистачить на всю дорогу, програма повинна повідомити, що пальне закінчилося.

void main(List<String> arguments) {
  print('What is the distance to your destination');
  int distance = int.parse(stdin.readLineSync()!);
  print('How much fuel do you have?');
  int fuelVolume = int.parse(stdin.readLineSync()!);
  print('What is the fuel consumption per 100 km');
  int fuelConsumption = int.parse(stdin.readLineSync()!);
  int km = 100;
  for (int i = 0; i <= distance; i += 10) {
    print('проїхали $i');
    if (i == km) {
      print('Ви проїхали ще $km км вітаємо ');
      km += 100;
      fuelVolume -= fuelConsumption;
      print('У вас залишилось :$fuelVolume л. палива');
    }
  }
}

// 300
//20 літрів
//10 на 100 км

// 10 км (20)
// 20 км (20)
// 30 км (20)
// 40 км (20)
// 50 км (20)
// 60 км (20)
// 70 км (20)
// 80 км (20)
// 90 км (20)
// 100 км (10)
// 110 км (10)
// 120 км (10)
// 130 км (10)
// 140 км (10)
// 150 км (10)
// 160 км (10)
// 170 км (10)
// 180 км (10)
// 190 км (10)
// 200 км (0)
// далі не їдемо
