import 'dart:io';

//Напиши програму, яка:
//
// 1. Запитує у користувача:
//
//    * Скільки грошей у нього є на рахунку (гроші);
//    * Скільки коштує 1 година стоянки (цінаГодини);
//    * Скільки годин користувач хоче простояти (бажаніГодини).
//
// 2. Починає "паркування" на кожну годину.
//
// 3. Після кожної години виводить скільки грошей залишилося.
//
// 4. Якщо грошей не вистачає на наступну годину, програма виводить повідомлення, що гроші закінчилися, і паркування припиняється.

void main(List<String> arguments) {
  print(
    'Доброго дня для парковки вам необхіднго вказати суму вашого рахунку )',
  );
  double cardMoney = double.parse(stdin.readLineSync()!);
  print('Вкажіть яка сума за 1 годину ');
  double parkingFeePerHour = double.parse(stdin.readLineSync()!);
  print('Вкажіть кількість годин скільки ви бажаєте простояти ?');
  int parkingTime = int.parse(stdin.readLineSync()!);
  print('Парковка розпочалась $parkingTime');
  for (int i = 1; i <= parkingTime; i++) {
    print('Пройшла $i година стоянки');
    cardMoney -= parkingFeePerHour;
    print('У вас на рахунку залишилось  $cardMoney');
    if (cardMoney < parkingFeePerHour) {
      print('Просимо поповнити рахунок або забрати автомобіль');
      break;
    }
  }
}
