import 'dart:io';

// Список улюблених фруктів із вибором
// Програма повинна:
//
// Створити масив із 5 улюблених фруктів (наприклад, [«Яблуко», «Банан», «Вишня», «Апельсин», «Груша»]).
// Попросити користувача ввести, скільки фруктів він хоче побачити (від 1 до 5).
// Вивести на екран обрану кількість фруктів із масиву з відповідними номерами.
// Якщо користувач введе число більше за 5, вивести повідомлення про те, що доступно тільки 5 фруктів.

void main(List<String> arguments) {
  List<String> fruits = ['Яблоко', 'Вишня', 'Банан', 'Апельсин', 'Груша'];
  print('Ось список фруктів які є:');
  for (int i = 0; i < fruits.length; i++) {
    print('-${fruits[i]}');
  }
  print('Вибери цифру кількість фруктів яку ти хоч побачити )');
  int number = int.parse(stdin.readLineSync()!);
  if (number > fruits.length || number <= 0) {
    print('Такої кількості фрукті немає ');
  } else {
    for (int i = 0; i < number; i++) {
      print('Ось фрукти які ви вибрали: ${fruits[i]}');
    }
  }
}
