import 'dart:developer';
import 'dart:io';
//Ти власник магазину магічних предметів. Ваше завдання:
// - Створити змінну з назвою магазину. Назва ніколи не змінюється.
// - Створити змінну з курсом золотої монети до долара. Курс змінюється щодня, але протягом роботи програми залишається незмінним.
// - Створити змінну зі списком товарів (наприклад: «Magic Wand», “Potion”, «Enchanted Sword»). Можна додавати та видаляти товари.
// - Створити змінну з ціною рідкісного товару. Ціна може бути як числом (валюта), так і рядком (обмін на інші товари).
// Вивести ціну двічі - до і після зміни.
// - Створити змінну з інформацією про покупця. Спочатку присвоїти ім'я, потім вік. Вивести в консоль.
// - Красиво вивести всю інформацію про магазин, товари і покупця в консоль наприкінці програми.
const shop = 'Magic shop';

void main() {
  print('Вітаємо у нашому $shop вкажіть своє імя :');
  String name = stdin.readLineSync()!;
  print('Вкажіть будь ласка ще свій вік ?');
  var userAge = stdin.readLineSync();
  print('Отож  $name $userAge вітаємо у нашому $shop ');
 var goldCoin = 43;
 print('Курс золотої монети : $goldCoin');
 List<String> listOfGoods = ['Magic Wand', 'Potion', 'Enchanted Sword'];
 print('Список товару у нашому $shop $listOfGoods');
 dynamic rareCommodity = 158;
 print('Ціна рідкісного товару становить $rareCommodity');
 rareCommodity='двісті сорок сім ';
 print('Ціна рідкісного товару становить $rareCommodity');
}