import 'dart:io';
import 'dart:math';

//Тобі потрібно реалізувати міні-гру «затопи російський корабель». Гравцеві потрібно вгадати випадкове положення корабля на полі,
// що складається з 10 клітинок. Програма повинна генерувати випадкову позицію корабля, а гравець - вводити здогадки, намагаючись вгадати
// точне розташування.
// Вимоги до задачі:
// Поле гри:
// Поле складається з 10 клітинок, які пронумеровані від 1 до 10.
// Рандомна позиція корабля:
// Корабель випадково розташовується в одній з 10 клітин.
// Введення від гравця:
// Програма має запитувати в користувача введення здогадки - ціле число, яке відповідає клітині, де, на думку гравця, розташований корабель.
// Перевірка введення:
// Якщо введення користувача менше ніж 1 або більше ніж 10, програма має повідомити, що введення некоректне, і
// попросити ввести число в правильному діапазоні.
// Підказки для гравця:
// Якщо здогадка користувача менша за позицію корабля, програма має вивести повідомлення: «'Занадто низько! Спробуй знову.'»
// Якщо здогадка користувача більша за позицію корабля, програма має вивести повідомлення: «Занадто високо! Спробуй знову.»
// Закінчення гри:
// Коли користувач вгадає правильну позицію, програма повинна привітати його і вивести повідомлення про точне місцезнаходження
// корабля: «Вітаю! Ти вгадав, корабель на позиції N!», де N - це випадково згенерована позиція корабля.
// Повторення гри:
// Програма має повторювати запит здогадки від користувача доти, доки він не вгадає правильне розташування корабля.
// Завершення роботи програми:
// У користувача є всього 4 спроби вгадати корабель. Якщо він використав всі, то програма пише, що спроби вичерпано.
// Після успішного вгадування програма вітає гравця з перемогою над російським кораблем
void main(List<String> arguments) {
  print(
    'Привіт зіграємо з тобою в гру затопи російський корабель.Тобі потрібно відгадати в якій комірці він стоїть комірок є 10',
  );
  Random random = Random();
  var numberGenerated = random.nextInt(10) + 1;
  numbersOfComparison(numberGenerated);
}

int userInput() {
  print(' Введіть число:');
  int userNumber = int.parse(stdin.readLineSync()!);
  while (userNumber < 0 || userNumber > 10) {
    print(
      'Нажаль ви ввели не коректне введення спробуйте ввести число від 1 до 10',
    );
    userNumber = int.parse(stdin.readLineSync()!);
  }
  return userNumber;
}

void numbersOfComparison(int numberGenerated) {
  int userNumber;
  do {
    userNumber=userInput();
    if (numberGenerated == userNumber) {
      print('Вітаю! Ти вгадав, корабель на позиції $numberGenerated!');
    } else if (numberGenerated > userNumber) {
      print('Занадто низько! Спробуй знову.');
    } else if (numberGenerated < userNumber) {
      print('Занадто високо! Спробуй знову.');
    }
  } while (userNumber!=numberGenerated);
}
