import 'dart:io';

//У вас є мішень з міцністю 200 одиниць. Кожен постріл зменшує міцність мішені на 50 одиниць.
// Програма виводить поточну міцність мішені після кожного пострілу та запрошує користувача натиснути Enter, щоб зробити наступний постріл.
// Гра продовжується, поки міцність мішені не стане рівною або меншою за 0. Як тільки мішень знищена, програма повідомляє про це та завершує роботу.
void main(List<String> arguments) {
  int targetsHealth = 200;
  while (targetsHealth >= 0) {
    print('У вас $targetsHealth одиниць щоб зробити постріл натиснітт ентер ');
    stdin.readLineSync()!;
    targetsHealth -= 50;
    if (targetsHealth == 0) {
      print('Гра завершено у вас 0 мішень');
    }
  }
  // for (int i = 200; i<0;i-50){
  //   print('У вас $i одиниць щоб зробити постріл напишіть сас');
  //   if(i==0){
  //     print('Гра завершено у вас 0 мішень');
  //   }
  // }
}
